; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-2-8)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	)
(:init
	(at plane1 city2)
	(= (capacity plane1) 4812)
	(= (fuel plane1) 278)
	(= (slow-burn plane1) 2)
	(= (fast-burn plane1) 6)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 9)
	(at plane2 city2)
	(= (capacity plane2) 4374)
	(= (fuel plane2) 1777)
	(= (slow-burn plane2) 2)
	(= (fast-burn plane2) 4)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 6)
	(at person1 city1)
	(at person2 city5)
	(at person3 city4)
	(at person4 city1)
	(at person5 city3)
	(at person6 city5)
	(at person7 city5)
	(at person8 city5)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 897)
	(= (distance city0 city2) 607)
	(= (distance city0 city3) 671)
	(= (distance city0 city4) 648)
	(= (distance city0 city5) 627)
	(= (distance city1 city0) 897)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 855)
	(= (distance city1 city3) 927)
	(= (distance city1 city4) 817)
	(= (distance city1 city5) 702)
	(= (distance city2 city0) 607)
	(= (distance city2 city1) 855)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 831)
	(= (distance city2 city4) 852)
	(= (distance city2 city5) 582)
	(= (distance city3 city0) 671)
	(= (distance city3 city1) 927)
	(= (distance city3 city2) 831)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 944)
	(= (distance city3 city5) 648)
	(= (distance city4 city0) 648)
	(= (distance city4 city1) 817)
	(= (distance city4 city2) 852)
	(= (distance city4 city3) 944)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 864)
	(= (distance city5 city0) 627)
	(= (distance city5 city1) 702)
	(= (distance city5 city2) 582)
	(= (distance city5 city3) 648)
	(= (distance city5 city4) 864)
	(= (distance city5 city5) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane2 city5)
	(at person1 city0)
	(at person2 city5)
	(at person3 city0)
	(at person4 city4)
	(at person5 city5)
	(at person6 city3)
	(at person7 city0)
	(at person8 city1)
	))

(:metric minimize (+ (* 2 (total-time))  (* 4 (total-fuel-used))))
)

; plan
1. (fly plane2 city2 city5)
   deleted: (at plane2 city2)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 0 to 1164, (fuel plane2) from 1777 to 613
   goals met: 2 of 9
2. (refuel plane2 city5)
   changed: (fuel plane2) from 613 to 4374
   goals met: 2 of 9
3. (board person6 plane2 city5)
   deleted: (at person6 city5)
   added: (in person6 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 2 of 9
4. (board person7 plane2 city5)
   deleted: (at person7 city5)
   added: (in person7 plane2)
   changed: (onboard plane2) from 1 to 2
   goals met: 2 of 9
5. (board person8 plane2 city5)
   deleted: (at person8 city5)
   added: (in person8 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 2 of 9
6. (fly plane2 city5 city1)
   deleted: (at plane2 city5)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 1164 to 2568, (fuel plane2) from 4374 to 2970
   goals met: 1 of 9
7. (debark person8 plane2 city1)
   deleted: (in person8 plane2)
   added: (at person8 city1)
   changed: (onboard plane2) from 3 to 2
   goals met: 2 of 9
8. (board person1 plane2 city1)
   deleted: (at person1 city1)
   added: (in person1 plane2)
   changed: (onboard plane2) from 2 to 3
   goals met: 2 of 9
9. (board person4 plane2 city1)
   deleted: (at person4 city1)
   added: (in person4 plane2)
   changed: (onboard plane2) from 3 to 4
   goals met: 2 of 9
10. (fly plane2 city1 city4)
   deleted: (at plane2 city1)
   added: (at plane2 city4)
   changed: (total-fuel-used) from 2568 to 4202, (fuel plane2) from 2970 to 1336
   goals met: 2 of 9
11. (debark person4 plane2 city4)
   deleted: (in person4 plane2)
   added: (at person4 city4)
   changed: (onboard plane2) from 4 to 3
   goals met: 3 of 9
12. (refuel plane2 city4)
   changed: (fuel plane2) from 1336 to 4374
   goals met: 3 of 9
13. (board person3 plane2 city4)
   deleted: (at person3 city4)
   added: (in person3 plane2)
   changed: (onboard plane2) from 3 to 4
   goals met: 3 of 9
14. (fly plane2 city4 city0)
   deleted: (at plane2 city4)
   added: (at plane2 city0)
   changed: (total-fuel-used) from 4202 to 5498, (fuel plane2) from 4374 to 3078
   goals met: 3 of 9
15. (debark person1 plane2 city0)
   deleted: (in person1 plane2)
   added: (at person1 city0)
   changed: (onboard plane2) from 4 to 3
   goals met: 4 of 9
16. (debark person3 plane2 city0)
   deleted: (in person3 plane2)
   added: (at person3 city0)
   changed: (onboard plane2) from 3 to 2
   goals met: 5 of 9
17. (debark person7 plane2 city0)
   deleted: (in person7 plane2)
   added: (at person7 city0)
   changed: (onboard plane2) from 2 to 1
   goals met: 6 of 9
18. (fly plane2 city0 city3)
   deleted: (at plane2 city0)
   added: (at plane2 city3)
   changed: (total-fuel-used) from 5498 to 6840, (fuel plane2) from 3078 to 1736
   goals met: 6 of 9
19. (debark person6 plane2 city3)
   deleted: (in person6 plane2)
   added: (at person6 city3)
   changed: (onboard plane2) from 1 to 0
   goals met: 7 of 9
20. (board person5 plane2 city3)
   deleted: (at person5 city3)
   added: (in person5 plane2)
   changed: (onboard plane2) from 0 to 1
   goals met: 7 of 9
21. (fly plane2 city3 city5)
   deleted: (at plane2 city3)
   added: (at plane2 city5)
   changed: (total-fuel-used) from 6840 to 8136, (fuel plane2) from 1736 to 440
   goals met: 8 of 9
22. (debark person5 plane2 city5)
   deleted: (in person5 plane2)
   added: (at person5 city5)
   changed: (onboard plane2) from 1 to 0
   goals met: 9 of 9
